app/controllers/videos_controller.rb

 def index
 	@videos = Video.order('created_at DESC').paginate(:page => params[:page], :per_page => 30)
---
SELECT  "videos".* FROM "videos"   ORDER BY video.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "videos"

def upvote_video
	fetch_video
	if current_user
		@video.vote_by voter: current_user, :vote => 'like', :duplicate => 'false'
		#flash[:notice] = "This video kicks ass right?"
		@video.save
---
INSERT INTO "votes" ("created_at", "updated_at", "votable_id", "votable_type", "vote_flag", "vote_weight", "voter_id", "voter_type") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"